       01  PLAYER-STATS.
           02  player-health  PIC 9(3) VALUE 100.
           02  player-mana    PIC 9(3) VALUE 80.
           02  player-energy  PIC 9(3) VALUE 80.
